InformationRegisters/ОбращенияПокупателейОтветыПроизводителейНаВключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияПокупателейОтветыПроизводителейНаВключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступленияРекламации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеТехнологическогоПроцессаВключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущиеМетодыКонтроляДанногоНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМерыМетодыКонтроляПослеНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеКонтрольныхТочекНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияПриПовторенииНарушения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПроизводствеУстановленаВидеоФиксация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНаблюдениеЗаКонтрольнойТочкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируетсяВнедрениеВидеонаблюденияЗаКонтрольнойТочкой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикреплённыеФайлы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрикреплённыхФайлов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВключенияОписаниеПостороннегоПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПопаданияПостороннегоВключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазработанныеПрограммыПредварительныхМероприятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемыеКорректирующиеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заполнил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамечаниеНаДоработку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияЗамечанийНаДоработку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>id_OK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID_Загрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бланк</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбращенияПокупателейОтветыПроизводителейНаВключения/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(Запись.ПрикреплённыеФайлы) Тогда
			Таб = ЗначениеИзСтрокиВнутр(Запись.ПрикреплённыеФайлы);
			Запись.КоличествоПрикреплённыхФайлов = Таб.Количество();
		Иначе	
			Запись.КоличествоПрикреплённыхФайлов = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//+++АК SHEP 2018.08.07 ИП-00018753.03
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если НЕ Отказ И ЭтотОбъект.Количество() > 0 Тогда //И Замещение Тогда
		
		СтруктураДанныеОтбор = Новый Структура("id_OK,GUID_Загрузки,ДатаДок");
		СтруктураДанные = Новый Структура("ТипВключенияОписаниеПостороннегоПредмета,ПричинаПопаданияПостороннегоВключения,ОписаниеТехнологическогоПроцессаВключения,
			|ТекущиеМетодыКонтроляДанногоНарушения,РазработанныеПрограммыПредварительныхМероприятий,ПринятыеМерыМетодыКонтроляПослеНарушения,ПланируемыеКорректирующиеДействия,
			|НаПроизводствеУстановленаВидеоФиксация,ЕстьНаблюдениеЗаКонтрольнойТочкой,ПланируетсяВнедрениеВидеонаблюденияЗаКонтрольнойТочкой,Комментарий,Заполнил");
		СтруктураСинонимы = Новый Структура(Новый ФиксированнаяСтруктура(СтруктураДанные));
		ЗаполнитьСинонимыПолей(СтруктураСинонимы);
		
		МенеджерЗаписиОбращенияПокупателей = РегистрыСведений.ОбращенияПокупателей.СоздатьМенеджерЗаписи();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураДанныеОтбор, Запись);
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиОбращенияПокупателей, СтруктураДанныеОтбор);
			МенеджерЗаписиОбращенияПокупателей.Прочитать();
			
			Если НЕ МенеджерЗаписиОбращенияПокупателей.Выбран() Тогда Продолжить; КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураДанные, Запись);
			
			МассивОтветыПроизводителя = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ОтветПроизводителя", ",");
			Для Каждого ИмяРекъОтветПроизводителя Из МассивОтветыПроизводителя Цикл
				ОтветПроизводителя = МенеджерЗаписиОбращенияПокупателей[ИмяРекъОтветПроизводителя];
				
				Поз1 = Найти(ОтветПроизводителя, "Ответ_производителя_начало");
				Поз2 = Найти(ОтветПроизводителя, "Ответ_производителя_конец");
				
				Если Поз1 > 0 Тогда
					ОтветПроизводителя1 = Лев(ОтветПроизводителя, Поз1 - 1);
					ОтветПроизводителя2 = ?(Поз2 = 0, "", Сред(ОтветПроизводителя, Поз2 + СтрДлина("Ответ_производителя_конец")));
				Иначе
					ОтветПроизводителя1 = ОтветПроизводителя;
					ОтветПроизводителя2 = "";
				КонецЕсли;
				
				ОтветПроизводителяНаВключения = "Ответ_производителя_начало";
				
				Для Каждого КлючИЗначение Из СтруктураДанные Цикл
					ОтветПроизводителяНаВключения = ОтветПроизводителяНаВключения + "
					|" + СтруктураСинонимы[КлючИЗначение.Ключ] + ":
					|  - " + КлючИЗначение.Значение + Символы.ПС;
				КонецЦикла;
				
				ОтветПроизводителяНаВключения = ОтветПроизводителяНаВключения + "
				|Ответ_производителя_конец";
				
				ОтветПроизводителя = ОтветПроизводителя1 + ?(ПустаяСтрока(ОтветПроизводителя1), "", Символы.ПС) + ОтветПроизводителяНаВключения + ОтветПроизводителя2;
				
				МенеджерЗаписиОбращенияПокупателей[ИмяРекъОтветПроизводителя] = ОтветПроизводителя;
			КонецЦикла;
			
			МенеджерЗаписиОбращенияПокупателей.ПерепискаСПроизводителем = МенеджерЗаписиОбращенияПокупателей.ПерепискаСПроизводителем +
				?(ПустаяСтрока(МенеджерЗаписиОбращенияПокупателей.ПерепискаСПроизводителем), "", Символы.ПС + "|" + Символы.ПС)
				+ "<Получен ответ производителя [" + Формат(ТекущаяДата(), "ДЛФ=DT") + "]>";
			
			МенеджерЗаписиОбращенияПокупателей.ТребуетОбязательногоОтветаПроизводителя = Ложь;
			МенеджерЗаписиОбращенияПокупателей.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//+++АК SHEP 2018.08.17 ИП-00018753.03
Процедура ЗаполнитьСинонимыПолей(СтруктураПолей)
Перем МетаданныеОбъекта;
	
	МетаданныеОбъекта = ЭтотОбъект.Метаданные();
	РеквизитыОбъектаМД = МетаданныеОбъекта.Реквизиты;
	
	Для Каждого КлючИЗначение Из СтруктураПолей Цикл
		ИмяРекъ = КлючИЗначение.Ключ;
		
		РеквизитОбъектаМД = РеквизитыОбъектаМД.Найти(ИмяРекъ);
		СтруктураПолей.Вставить(ИмяРекъ, ?(РеквизитОбъектаМД = Неопределено, ИмяРекъ, РеквизитОбъектаМД.Синоним));
	КонецЦикла;
	
КонецПроцедуры
